Revit 2024 API
ParameterDownloadOptions Constructor (ISet<ElementId>, Boolean, Boolean, ForgeTypeId)
 Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ParameterDownloadOptions(
	ISet<ElementId> categories,
	bool isInstance,
	bool visible,
	ForgeTypeId groupTypeId
)
Visual Basic
Public Sub New ( _
	categories As ISet(Of ElementId), _
	isInstance As Boolean, _
	visible As Boolean, _
	groupTypeId As ForgeTypeId _
)
Visual C++
public:
ParameterDownloadOptions(
	ISet<ElementId^>^ categories,
	bool isInstance,
	bool visible,
	ForgeTypeId^ groupTypeId
)
Parameters
categories
Type: System.Collections.Generic.ISet<ElementId>
 The category identifiers.
isInstance
Type: System.Boolean
 True if binding to Element instances, false if binding to Element types.
visible
Type: System.Boolean
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
groupTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Properties palette group identifier.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ParameterDownloadOptions Class
ParameterDownloadOptions Overload
Autodesk.Revit.DB Namespace